app/controllers/reservables_controller.rb

  def index
    #Reservable.create_cache

    @location = Location.find(1)
    @sport = Sport.find(2)
---
SELECT `locations`.* FROM `locations` WHERE (`locations`.`id` = 1) LIMIT 1
SELECT `sports`.* FROM `sports` WHERE (`sports`.`id` = 2) LIMIT 1